namespace CountingGame
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // 숫자 맞추기 게임

            // 간단하게 이 게임이 숫자 맞추기 게임이다 라는 것을 보여줄 수 있는 숫자 1을 누르면 게임시작, 숫자 2를 누르면 게임 종료 (Title 구현)

            // 메인 로직

            // 동적으로 할당 받은 데이터를 바탕으로 반복문을 사용해서 입력 받은
            
            // 숫자가 클 때   :  "입력 받은 숫자가 정해진 값 보다 큽니다"     
             
            // 숫자가 작을 때 :  "입력 받은 숫자가 정해진 값 보다 작습니다"

            // 남은 횟수가 n번 남았습니다. 반복문을 구현해보시고

            // n번 안에 성공하면 반복문을 탈출해서 . 게임 클리어 로직을 작성하시면 됩니다.

            // n번 안에 성공 못했을 경우 게임 패배 로직을 작성하시면 됩니다.
        }
    }
}
